# coding = utf-8

"""
跟问题1很相似，但是这时候我的数组里的数并不需要“连续”跟你一样，才能称之为“有你的数组”，但是顺序依旧重要。 举个栗子: [0,7,1,7,2,7,3] 包含 [0,1,2,3] 因为我们可以无视掉7。但是[3,2,1,7]不包含[1,2,3]因为他们的排列顺序不一样。

例子：
输入:[1,3,2,4,3,5,6],[1,2,3,6]                输出:1
输入:[1,2,1,1],[1,1,1]                        输出:1
输入:[1,2,1,2,0,1,2],[2,1,2,1]                输出:1
输入:[3,2,1,0,7],[7,1,2,3]                    输出:0
输入:[1,3,5],[2]                              输出:0
"""

def function(list1, list2):
   n = 0
   for i in xrange(n, len(list1)):
      #print n, '@@@@'
      #print list1[i], list2[0]
      if list1[i] == list2[0]:
         list2 = list2[1:]
         n = i
      if list2 == []: return 1
      
   return 0

if __name__ == '__main__':
   print function([1,3,2,4,3,5,6],[1,2,3,6])
   print function([1,2,1,1],[1,1,1])
   print function([1,2,1,2,0,1,2],[2,1,2,1] )
   print function([3,2,1,0,7],[7,1,2,3])
   print function([1,3,5],[2] )

         
         
       
   


